#### Connect to the Database

In [39]:
import pandas as pd
from sqlalchemy import create_engine

# establish a database connection
engine = create_engine("postgresql+psycopg2://postgres:postgres@localhost:5432/lahman-baseball")
# Replace `<lahman_baseball_database_name>` with the actual name of your lahman baseball database as it appears in pgadmin

# use the connection to run a query using pandas!
batting_df = pd.read_sql("SELECT * FROM batting;", con=engine)
batting_df.head()
people_df = pd.read_sql("SELECT * FROM people;", con=engine)
people_df.head()
schools_df = pd.read_sql("SELECT * FROM schools;", con=engine)
schools_df.head()
collegeplaying_df = pd.read_sql("SELECT * FROM collegeplaying;", con=engine)
collegeplaying_df.head()
salaries_df = pd.read_sql("SELECT * FROM salaries;", con=engine)
salaries_df.head()

   yearid teamid lgid   playerid    salary
0    1985    ATL   NL  barkele01  870000.0
1    1985    ATL   NL  bedrost01  550000.0
2    1985    ATL   NL  benedbr01  545000.0
3    1985    ATL   NL   campri01  633333.0
4    1985    ATL   NL  ceronri01  625000.0

#### 1
a. Find all players in the database who played at Vanderbilt University.

In [33]:
# Filter the dataframe to have Vanderbilt from the Schools_df
vanderbilt_df = schools_df[schools_df['schoolname']=='Vanderbilt University']
vanderbilt_df
# Merge the vanderbilt dataframe to the college playing on column schoolid

   schoolid   playerid
0     vandy  alvarpe01
3     vandy  baxtemi01
5     vandy  chrisni01
9     vandy  colliwi01
12    vandy   corajo01
15    vandy  embresl01
18    vandy  flahery01
21    vandy   grayso01
24    vandy  hendrha01
25    vandy   katama01
28    vandy  lewisje01
31    vandy  madissc01
35    vandy  minormi01
38    vandy  mooresc01
41    vandy   mossma01
44    vandy   pauljo01
47    vandy  priceda01
50    vandy  priorma01
51    vandy  richaan01
53    vandy  sandesc01
55    vandy  sewelri01
57    vandy  sowerje01
60    vandy  willimi01
63    vandy   zeidjo01

In [34]:
# Merge the vanderbilt dataframe to the college playing on column schoolid
c_play_df = pd.merge(vanderbilt_df, collegeplaying_df, how='left', on='schoolid')
# Selecting only the two required columns -- note the [[]]
c_play_df2 = c_play_df[['schoolid','playerid']]
# Since a player played several years with the school, we dropped year id, lets remove the duplicates to have unique
c_play_df3 = c_play_df2.drop_duplicates()#)
c_play_df3

   schoolid   playerid
0     vandy  alvarpe01
3     vandy  baxtemi01
5     vandy  chrisni01
9     vandy  colliwi01
12    vandy   corajo01
15    vandy  embresl01
18    vandy  flahery01
21    vandy   grayso01
24    vandy  hendrha01
25    vandy   katama01
28    vandy  lewisje01
31    vandy  madissc01
35    vandy  minormi01
38    vandy  mooresc01
41    vandy   mossma01
44    vandy   pauljo01
47    vandy  priceda01
50    vandy  priorma01
51    vandy  richaan01
53    vandy  sandesc01
55    vandy  sewelri01
57    vandy  sowerje01
60    vandy  willimi01
63    vandy   zeidjo01

In [38]:
#Merge the players with people table and filter the necessary columns
player1_df = pd.merge(c_play_df3, people_df, how='inner', on='playerid')
vandy_player_df = player1_df[['schoolid','playerid','namegiven','namefirst','namelast']]
vandy_player_df

   schoolid   playerid         namegiven namefirst    namelast
0     vandy  alvarpe01      Pedro Manuel     Pedro     Alvarez
1     vandy  baxtemi01    Michael Joseph      Mike      Baxter
2     vandy  chrisni01     Nicholas John      Nick  Christiani
3     vandy  colliwi01      Cyril Wilson    Wilson     Collins
4     vandy   corajo01       Jose Manuel      Joey        Cora
5     vandy  embresl01      Charles Akin      Slim       Embry
6     vandy  flahery01       Ryan Edward      Ryan    Flaherty
7     vandy   grayso01     Sonny Douglas     Sonny        Gray
8     vandy  hendrha01            Harvey    Harvey    Hendrick
9     vandy   katama01      Matthew John      Matt        Kata
10    vandy  lewisje01     Jensen Daniel    Jensen       Lewis
11    vandy  madissc01     Charles Scott    Scotti     Madison
12    vandy  minormi01     Michael David      Mike       Minor
13    vandy  mooresc01     William Allen   Scrappy       Moore
14    vandy   mossma01   Charles Malcolm       Mal        Moss
15    vandy   pauljo01    Joshua William      Josh        Paul
16    vandy  priceda01      David Taylor     David       Price
17    vandy  priorma01      Mark William      Mark       Prior
18    vandy  richaan01     Antoan Edward    Antoan  Richardson
19    vandy  sandesc01     Scott Douglas     Scott   Sanderson
20    vandy  sewelri01      Truett Banks       Rip      Sewell
21    vandy  sowerje01      Jeremy Bryan    Jeremy      Sowers
22    vandy  willimi01     Michael Henry      Mike      Willis
23    vandy   zeidjo01  Joshua Alexander      Josh        Zeid

b. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues.

In [40]:
# Merge the vandy_player_df to the salaries_df and filter the necessary columns
total_df = pd.merge(vandy_player_df, salaries_df, how='inner', on='playerid')
total_df

,schoolid,playerid,namegiven,namefirst,namelast,yearid,teamid,lgid,salary
0,vandy,alvarpe01,Pedro Manuel,Pedro,Alvarez,2011,PIT,NL,2050000.0
1,vandy,alvarpe01,Pedro Manuel,Pedro,Alvarez,2012,PIT,NL,2200000.0
2,vandy,alvarpe01,Pedro Manuel,Pedro,Alvarez,2013,PIT,NL,700000.0
3,vandy,alvarpe01,Pedro Manuel,Pedro,Alvarez,2014,PIT,NL,4250000.0
4,vandy,alvarpe01,Pedro Manuel,Pedro,Alvarez,2015,PIT,NL,5750000.0
...,...,...,...,...,...,...,...,...,...
69,vandy,sandesc01,Scott Douglas,Scott,Sanderson,1993,NYA,AL,250000.0
70,vandy,sandesc01,Scott Douglas,Scott,Sanderson,1994,CHA,AL,350000.0
71,vandy,sandesc01,Scott Douglas,Scott,Sanderson,1995,CAL,AL,250000.0
72,vandy,sandesc01,Scott Douglas,Scott,Sanderson,1996,CAL,AL,200000.0
73,vandy,sowerje01,Jeremy Bryan,Jeremy,Sowers,2007,CLE,AL,384800.0

c. Sort this list in descending order by the total salary earned.

In [54]:
salary_grouped = total_df.groupby(['playerid','namefirst','namelast'],as_index=False).sum()
salary_grouped.drop('yearid', inplace=True)
salary_grouped

KeyError: "['yearid'] not found in axis"

d. Which Vanderbilt player earned the most money in the majors?

#### Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.



Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.
a. From 1970 – 2016, what is the largest number of wins for a team that did not win the world series?
b. What is the smallest number of wins for a team that did win the world series?
c. Doing this will probably result in an unusually small number of wins for a world series champion – determine why this is the case.
d. Then redo your query, excluding the problem year.
e. How often from 1970 – 2016 was it the case that a team with the most wins also won the world series?
f. What percentage of the time?
Which managers have won the TSN Manager of the Year award in both the National League (NL) and the American League (AL)? Give their full name and the teams that they were managing when they won the award.